MingYuan0415/MicroTech/sdkconfig.defaults
# This file was generated using idf.py save-defconfig or menuconfig [D] key. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 6.0.2 Project Minimal Configuration
#
# default:
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_16m_ota_res_data.csv"
# CONFIG_FREERTOS_UNICORE is not set
# CONFIG_FREERTOS_SMP is not set
CONFIG_MAIN_PROJECT_TASK_AFFINITY_CPU0=y
# CONFIG_MAIN_PROJECT_TASK_AFFINITY_CPU1 is not set
# CONFIG_MAIN_PROJECT_TASK_AFFINITY_NO_AFFINITY is not set
CONFIG_MAIN_WEATHER_SERVER_BASE_URL="https://weather.example.com"
CONFIG_MAIN_WEATHER_DEVICE_TOKEN="example-device-token"
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
# CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_INTERNAL is not set
CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_EXTERNAL=y
# CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_DEFAULT is not set
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=6144
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_GATT_CLIENT=n
CONFIG_BT_NIMBLE_GATT_SERVER=y
CONFIG_BT_NIMBLE_SECURITY_ENABLE=n
CONFIG_BT_NIMBLE_NVS_PERSIST=n
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=500
CONFIG_BT_CTRL_BLE_MAX_ACT=2
CONFIG_BT_CTRL_PINNED_TO_CORE_0=y
# CONFIG_BT_CTRL_PINNED_TO_CORE_1 is not set
CONFIG_BT_NIMBLE_PINNED_TO_CORE_0=y
# CONFIG_BT_NIMBLE_PINNED_TO_CORE_1 is not set
CONFIG_PM_ENABLE=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=2048
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=131072
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
CONFIG_ESP_MAIN_TASK_AFFINITY_CPU0=y
# CONFIG_ESP_MAIN_TASK_AFFINITY_CPU1 is not set
# CONFIG_ESP_MAIN_TASK_AFFINITY_NO_AFFINITY is not set
CONFIG_ESP_WIFI_TASK_PINNED_TO_CORE_0=y
# CONFIG_ESP_WIFI_TASK_PINNED_TO_CORE_1 is not set
CONFIG_ESP_TIMER_TASK_AFFINITY_CPU0=y
# CONFIG_ESP_TIMER_TASK_AFFINITY_CPU1 is not set
# CONFIG_ESP_TIMER_TASK_AFFINITY_NO_AFFINITY is not set
CONFIG_ESP_TIMER_ISR_AFFINITY_CPU0=y
# CONFIG_ESP_TIMER_ISR_AFFINITY_CPU1 is not set
# CONFIG_ESP_TIMER_ISR_AFFINITY_NO_AFFINITY is not set
CONFIG_ESP_WIFI_NVS_ENABLED=y
CONFIG_ESP_PROTOCOMM_SUPPORT_SECURITY_VERSION_2=y
CONFIG_ESP_PROTOCOMM_SUPPORT_SECURITY_PATCH_VERSION=y
CONFIG_CONNECTIVITY_MANAGER_TASK_STACK=6144
CONFIG_PROVISIONING_SERVICE_TASK_STACK=6144
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TIMER_TASK_AFFINITY_CPU0=y
# CONFIG_FREERTOS_TIMER_TASK_AFFINITY_CPU1 is not set
# CONFIG_FREERTOS_TIMER_TASK_NO_AFFINITY is not set
# CONFIG_LWIP_TCPIP_TASK_AFFINITY_NO_AFFINITY is not set
CONFIG_LWIP_TCPIP_TASK_AFFINITY_CPU0=y
# CONFIG_LWIP_TCPIP_TASK_AFFINITY_CPU1 is not set
# CONFIG_PTHREAD_DEFAULT_CORE_NO_AFFINITY is not set
CONFIG_PTHREAD_DEFAULT_CORE_0=y
# CONFIG_PTHREAD_DEFAULT_CORE_1 is not set
# CONFIG_APP_MANAGER_LVGL_WORKER_AFFINITY_CPU0 is not set
CONFIG_APP_MANAGER_LVGL_WORKER_AFFINITY_CPU1=y
# CONFIG_APP_MANAGER_LVGL_WORKER_AFFINITY_NO_AFFINITY is not set
CONFIG_APP_MANAGER_LVGL_WORKER_STACK_SIZE=32768
CONFIG_APP_MANAGER_PAGE_STATE_BYTES=2728
CONFIG_APP_MANAGER_NAV_COMMAND_CAPACITY=8
CONFIG_APP_MANAGER_MAILBOX_CAPACITY=12
CONFIG_ESP_LVGL_ADAPTER_ENABLE_FS=y
CONFIG_ESP_LVGL_ADAPTER_ENABLE_FREETYPE=y
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y
CONFIG_LV_DEF_REFR_PERIOD=15
CONFIG_LV_OS_NONE=y
CONFIG_LV_DRAW_SW_DRAW_UNIT_CNT=1
CONFIG_LV_OBJ_STYLE_CACHE=y
CONFIG_LV_USE_GESTURE_RECOGNITION=y
CONFIG_LV_USE_FLOAT=y
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_18=y
CONFIG_LV_USE_QRCODE=y
CONFIG_LV_USE_FREETYPE=y
CONFIG_LV_FREETYPE_USE_LVGL_PORT=y
